krayon/pinball-OPP/Stm32Workbench/OppGen3/Src/Common/digital.c
/*
 *===============================================================================
 *
 *                         OOOOOO
 *                       OOOOOOOOOO
 *      PPPPPPPPPPPPP   OOO      OOO   PPPPPPPPPPPPP
 *    PPPPPPPPPPPPPP   OOO        OOO   PPPPPPPPPPPPPP
 *   PPP         PPP   OOO        OOO   PPP         PPP
 *  PPP          PPP   OOO        OOO   PPP          PPP
 *  PPP          PPP   OOO        OOO   PPP          PPP
 *  PPP          PPP   OOO        OOO   PPP          PPP
 *   PPP         PPP   OOO        OOO   PPP         PPP
 *    PPPPPPPPPPPPPP   OOO        OOO   PPPPPPPPPPPPPP
 *     PPPPPPPPPPPPP   OOO        OOO   PPP
 *               PPP   OOO        OOO   PPP
 *               PPP   OOO        OOO   PPP
 *               PPP   OOO        OOO   PPP
 *               PPP    OOO      OOO    PPP
 *               PPP     OOOOOOOOOO     PPP
 *              PPPPP      OOOOOO      PPPPP
 *
 * @file:   digital.c
 * @author: Hugh Spahr
 * @date:   12/02/2012
 *
 * @note:   Open Pinball Project
 *          Copyright� 2012-2015, Hugh Spahr
 *
 *  This program is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation, either version 3 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with this program.  If not, see <http://www.gnu.org/licenses/>.
 *
 *===============================================================================
 */
/**
 * This file controls the digital wing boards (inputs/solenoids).  It is
 * adapted from digital.c in the previous 1003-InpDrv\Sources\digital.c
 *
 *===============================================================================
 */
 
#include <stdlib.h>
#include "stdtypes.h"
#include "stdlintf.h"
#include "rs232intf.h"
#include "gen2glob.h"
#include "procdefs.h"         /* for EnableInterrupts macro */

#include "stm32f1xx_hal.h"

#define STDL_FILE_ID          3

typedef struct
{
   GPIO_TypeDef               *port_p;
   uint16_t                   GPIO_Pin;
} DIG_PIN_INFO_T;

const DIG_PIN_INFO_T dig_pinInfo[RS232I_NUM_GEN2_INP] =
   {  { GPIOA, GPIO_PIN_13 }, { GPIOB, GPIO_PIN_12 },
      { GPIOB, GPIO_PIN_13 }, { GPIOB, GPIO_PIN_14 },
      { GPIOB, GPIO_PIN_15 }, { GPIOA, GPIO_PIN_8 },
      { GPIOA, GPIO_PIN_9 }, { GPIOA, GPIO_PIN_10 },

      { GPIOA, GPIO_PIN_15 }, { GPIOB, GPIO_PIN_3 },
      { GPIOB, GPIO_PIN_4 }, { GPIOB, GPIO_PIN_5 },
      { GPIOB, GPIO_PIN_6 }, { GPIOB, GPIO_PIN_7 },
      { GPIOB, GPIO_PIN_8 }, { GPIOB, GPIO_PIN_9 },

      { GPIOA, GPIO_PIN_14 }, { GPIOC, GPIO_PIN_13 },
      { GPIOC, GPIO_PIN_14 }, { GPIOC, GPIO_PIN_15 },
      { GPIOA, GPIO_PIN_0 }, { GPIOA, GPIO_PIN_1 },
      { GPIOA, GPIO_PIN_2 }, { GPIOA, GPIO_PIN_3 },

      { GPIOA, GPIO_PIN_4 }, { GPIOA, GPIO_PIN_5 },
      { GPIOA, GPIO_PIN_6 }, { GPIOA, GPIO_PIN_7 },
      { GPIOB, GPIO_PIN_0 }, { GPIOB, GPIO_PIN_1 },
      { GPIOB, GPIO_PIN_10 }, { GPIOB, GPIO_PIN_11 } };

typedef enum
{
   SOL_STATE_IDLE             = 0x00,
   SOL_INITIAL_KICK           = 0x01,
   SOL_SUSTAIN_PWM            = 0x02,
   SOL_MIN_TIME_OFF           = 0x03,
   SOL_WAIT_BEFORE_KICK       = 0x04,
   SOL_FULL_ON_SOLENOID       = 0x05,
} __attribute__((packed)) DIG_SOL_STATE_E;

typedef struct
{
   BOOL                       clearRcvd;
   DIG_SOL_STATE_E            solState;
   U8                         offCnt;
   INT                        bit;
   INT                        startMs;
   U32                        inpBits;
} DIG_SOL_STATE_T;

typedef struct
{
   INT                        cnt;
} DIG_INP_STATE_T;

#define MATRIX_FIRE_SOL       0x80
#define MATRIX_SOL_MASK       0x07

typedef struct
{
   U8                         cnt;
   U8                         sol;
} DIG_MTRX_BIT_INFO_T;

typedef struct
{
   U8                         index;
   DIG_MTRX_BIT_INFO_T        info[RS232I_SW_MATRX_INP];
} DIG_MATRIX_DATA_T;

typedef struct
{
   U16                        port;
   U16                        msk;
} DIG_PORT_DATA_T;

typedef struct
{
   U32                        inpMask;
   U16                        solMask;
   U32                        prevInputs;
   U32                        filtInputs;
   U32                        mtrxInpMask;
   U32                        stateMask;
   U32                        outputUpd;
   U32                        outputMask;
   DIG_PORT_DATA_T            updPort[STDLI_NUM_DIG_PORT];
   DIG_MATRIX_DATA_T          *matrix_p;
   DIG_INP_STATE_T            inpState[RS232I_NUM_GEN2_INP];
   DIG_SOL_STATE_T            solState[RS232I_NUM_GEN2_SOL];
} DIG_GLOB_T;

DIG_GLOB_T                    dig_info;

/* Prototypes */
INT timer_get_ms_count();
void digital_set_solenoid_input(
   RS232I_SET_SOL_INP_E       inputIndex,
   U8                         solIndex);
void digital_upd_sol_cfg(
   U16                        updMask);
void digital_upd_inp_cfg(
   U32                        updMask);
void digital_upd_outputs(
   U32                        value,
   U32                        mask);

/*
 * ===============================================================================
 * 
 * Name: digital_init
 * 
 * ===============================================================================
 */
/**
 * Initialize the digital I/O port
 * 
 * Initialize digital I/O port, and the other digital control signals.
 * 
 * @param   None 
 * @return  None
 * 
 * @pre     None 
 * @note    None
 * 
 * ===============================================================================
 */
void digital_init(void) 
{
   DIG_SOL_STATE_T            *solState_p;
   INT                        index;
   BOOL                       foundSol = FALSE;
   RS232I_CFG_INP_TYPE_E      *inpCfg_p;
   RS232I_SOL_CFG_T           *solCfg_p;
   U32                        outputMask = 0;
   GPIO_InitTypeDef           pinCfg;
   BOOL                       usedBit;

