krayon/pinball-OPP/Stm32Workbench/OppGen3/Src/Common/digital.c
#define INPUT_BIT_MASK        0xff
#define DBG_INPUT_BIT_MASK    0xfe
#define INCAND_OUTP_MASK      0xff
#define DBG_INCAND_OUTP_MASK  0xfe
#define NEO_W0_INP_BIT_MASK   0xef
#define DBG_NEO_W0_INP_BIT_MASK   0xee
#define NEO_W0_OUT_BIT_MASK   0x10
#define NEO_W13_INP_BIT_MASK  0xf7
#define NEO_W13_OUT_BIT_MASK  0x08
#define NEO_OUTP_BIT_MASK     0x01
#define SOL_INP_BIT_MASK      0x0f  
#define DBG_SOL_INP_BIT_MASK  0x0e
#define SOL_OUTP_BIT_MASK     0xf0

#define MTRX_INPUT_BIT_MASK   0xff000000
#define MTRX_OUTPUT_BIT_MASK  0x00ff0000
#define DBG_MTRX_OUT_BIT_MASK 0x00fe0000
   
   if (gen2g_info.inpCfg_p == NULL)
   {
      for (solState_p = &dig_info.solState[0], index = 0;
         index < RS232I_NUM_GEN2_SOL; index++, solState_p++)
      {
         solState_p->solState = SOL_STATE_IDLE;
         solState_p->bit = 1 << (((index >> 2) << 3) + (index & 0x03) + 4);
         solState_p->inpBits = 0;
      }
      dig_info.inpMask = 0;
      dig_info.solMask = 0;
      dig_info.filtInputs = 0;
      dig_info.mtrxInpMask = 0;
     
      /* Set up digital ports, walk through wing boards */
      for (index = 0; index < RS232I_NUM_WING; index++)
      {
         /* Check if this wing board is a input driver */
         if (gen2g_info.nvCfgInfo.wingCfg[index] == WING_INP)
         {
#if GEN2G_DEBUG_PORT == 0
             /* Set up bit mask of valid inputs */
             dig_info.inpMask |= (INPUT_BIT_MASK << (index << 3));
#else
             if ((index == 0) || (index == 2))
             {
                 dig_info.inpMask |= (DBG_INPUT_BIT_MASK << (index << 3));
             }
             else
             {
                 dig_info.inpMask |= (INPUT_BIT_MASK << (index << 3));
             }
#endif
         }
         /* Check if this wing board is a solenoid driver */
         else if (gen2g_info.nvCfgInfo.wingCfg[index] == WING_SOL)
         {
            foundSol = TRUE;
            
            outputMask |= (SOL_OUTP_BIT_MASK << (index << 3));
            dig_info.solMask |= (SOL_INP_BIT_MASK << (index << 2));
            
#if GEN2G_DEBUG_PORT == 0
            /* Set up bit mask of valid inputs */
            dig_info.inpMask |= (SOL_INP_BIT_MASK << (index << 3));
#else
             if ((index == 0) || (index == 2))
             {
                 dig_info.inpMask |= (DBG_SOL_INP_BIT_MASK << (index << 3));
             }
             else
             {
                 dig_info.inpMask |= (SOL_INP_BIT_MASK << (index << 3));
             }
#endif
         }
         /* Check if wing 2 is WING_SW_MATRIX_OUT, and wing 3 is WING_SW_MATRIX_IN.
          *   Other positions are not allowed.
          */
         else if (gen2g_info.nvCfgInfo.wingCfg[index] == WING_SW_MATRIX_OUT)
         {
            if ((index == 2) && (gen2g_info.nvCfgInfo.wingCfg[3] == WING_SW_MATRIX_IN))
            {
               dig_info.matrix_p = malloc(sizeof(DIG_MATRIX_DATA_T));
               dig_info.matrix_p->index = 0;
#if GEN2G_DEBUG_PORT == 0
               outputMask |= MTRX_OUTPUT_BIT_MASK;
#else
               outputMask |= DBG_MTRX_OUT_BIT_MASK;
#endif
               dig_info.mtrxInpMask |= MTRX_INPUT_BIT_MASK;
            }
            else
            {
               gen2g_info.error = ERR_SW_MATRIX_WING_BAD_LOC;
            }
         }
         /* NEO wing can be wing 0, wing 1, or wing 3 */
         else if (gen2g_info.nvCfgInfo.wingCfg[index] == WING_NEO)
         {
            if (index == 0)
            {
#if GEN2G_DEBUG_PORT == 0
               dig_info.inpMask |= (NEO_W0_INP_BIT_MASK << (index << 3));
#else
               dig_info.inpMask |= (DBG_NEO_W0_INP_BIT_MASK << (index << 3));
#endif
               outputMask |= (NEO_W0_OUT_BIT_MASK << (index << 3));
            }
            else if ((index == 1) || (index == 3))
            {
                dig_info.inpMask |= (NEO_W13_INP_BIT_MASK << (index << 3));
                outputMask |= (NEO_W13_OUT_BIT_MASK << (index << 3));
            }
            else
            {
               gen2g_info.error = ERR_NEO_WING_BAD_LOC;
            }
         }
         else if ((gen2g_info.nvCfgInfo.wingCfg[index] == WING_INCAND) ||
            (gen2g_info.nvCfgInfo.wingCfg[index] == WING_HI_SIDE_INCAND))
         {
            outputMask |= (INCAND_OUTP_MASK << (index << 3));
#if GEN2G_DEBUG_PORT == 0
            outputMask |= (INCAND_OUTP_MASK << (index << 3));
#else
            if ((index == 0) || (index == 2))
            {
               outputMask |= (DBG_INCAND_OUTP_MASK << (index << 3));
            }
            else
            {
               outputMask |= (INCAND_OUTP_MASK << (index << 3));
            }
#endif
         }
      }
      for (index = 0; index < RS232I_NUM_GEN2_INP; index++)
      {
    	  usedBit = FALSE;
    	  pinCfg.Pin = dig_pinInfo[index].GPIO_Pin;
          if ((dig_info.inpMask & (1 << index)) != 0)
          {
        	  pinCfg.Mode = GPIO_MODE_INPUT;
              pinCfg.Pull = GPIO_PULLUP;
        	  usedBit = TRUE;
          }
          else if ((dig_info.mtrxInpMask & (1 << index)) != 0)
          {
        	  pinCfg.Mode = GPIO_MODE_INPUT;
              pinCfg.Pull = GPIO_PULLDOWN;
        	  usedBit = TRUE;
          }
          else if ((outputMask & (1 << index)) != 0)
          {
        	  pinCfg.Mode = GPIO_MODE_OUTPUT_PP;
              pinCfg.Speed = GPIO_SPEED_FREQ_LOW;
        	  usedBit = TRUE;
          }
          if (usedBit)
          {
             HAL_GPIO_Init(dig_pinInfo[index].port_p, &pinCfg);
          }
      }
      dig_info.filtInputs = stdldigio_read_all_ports(dig_info.inpMask | dig_info.mtrxInpMask);
      
      /* Set the location of the configuration data */
      gen2g_info.inpCfg_p = (GEN2G_INP_CFG_T *)gen2g_info.freeCfg_p;
      gen2g_info.freeCfg_p += sizeof(GEN2G_INP_CFG_T);
      if (foundSol)
      {
         gen2g_info.solDrvCfg_p = (GEN2G_SOL_DRV_CFG_T *)gen2g_info.freeCfg_p;
         gen2g_info.freeCfg_p += sizeof(GEN2G_SOL_DRV_CFG_T);
      }
      
      /* Set up initial configuration of solenoids from NV config */
      for (index = 0; index < RS232I_NUM_WING; index++)
      {
         if (gen2g_info.nvCfgInfo.wingCfg[index] == WING_SOL)
         {
            /* Configure the inputs for the solenoids */
            for (inpCfg_p = &gen2g_info.inpCfg_p->inpCfg[index << 3];
               inpCfg_p < &gen2g_info.inpCfg_p->inpCfg[(index << 3) + 8];
               inpCfg_p++)
            {
               *inpCfg_p = STATE_INPUT;
            }
         }
      }

